md-asaduzzaman-shahin/esp32_csi_sensing_fall_detection/transmitter/managed_components/espressif__esp-radar/src/esp_radar.c
/*
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "freertos/queue.h"

#include "esp_mac.h"
#include "esp_system.h"
#include "esp_wifi.h"
#include "esp_log.h"
#include "esp_check.h"
#include "esp_private/esp_wifi_he_types_private.h"
#include "esp_radar.h"
#include "esp_csi_gain_ctrl.h"
#include "utils.h"

static const char *TAG                          = "esp_radar";
static const char *TAG_DETECTION                = "csi_detection_task";
static const char *TAG_TRAIN                     = "esp_radar_train";
#define CSI_DETECTION_EXIT_BIT      BIT0
#define CSI_PREPROCESSING_EXIT_BIT  BIT1

#define RADAR_PCA_WINDOW_DEFAULT      4

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
#define ESP_IF_WIFI_STA ESP_MAC_WIFI_STA
#endif

/**
 * @brief CSI amplitude ring buffer structure
 *
 * Stores CSI amplitude data, timestamps, and sequence IDs in a ring buffer format
 */
typedef struct {
    float **amplitude;      /**< 2D array for amplitude data: [buff_size][subcarrier_len] */
    uint32_t *timestamp;    /**< Timestamp array: [buff_size] */
    uint32_t *seq_id;       /**< Frame sequence ID array: [buff_size] */
} csi_data_buff_t;

/**
 * @brief CSI window context structure
 *
 * Manages ring buffer and sliding window operations for CSI data processing
 */
typedef struct {
    uint32_t buff_size;         /**< Ring buffer capacity (number of frames) */
    uint32_t handle_window;     /**< Target processing window size (number of frames) */
    uint32_t window_start_seq;  /**< Current window start frame absolute sequence number */
    uint32_t next_seq;          /**< Next frame absolute sequence number to write */
    uint32_t last_timestamp;    /**< Last processed frame timestamp (ms) */
} csi_window_ctx_t;

/**
 * @brief Radar context structure
 *
 * Main context structure containing all radar system state and configuration
 */
typedef struct {
    EventGroupHandle_t          task_exit_group;     /**< Event group for task exit synchronization */
    QueueHandle_t               csi_info_queue;      /**< Queue for CSI filtered information */
    QueueHandle_t               csi_data_queue;      /**< Queue for CSI data buffer indices */
    esp_radar_dec_config_t      dec_config;          /**< Decoder configuration */
    esp_radar_csi_config_t      csi_config;         /**< CSI configuration */
    esp_radar_wifi_config_t     wifi_config;        /**< WiFi configuration */
    esp_radar_espnow_config_t   espnow_config;       /**< ESP-NOW configuration */
    bool                        init_flag;          /**< Initialization flag */
    bool                        run_flag;           /**< Running flag */
    csi_window_ctx_t            window_ctx;         /**< Ring buffer and window management context */
    uint16_t                    subcarrier_len;     /**< Subcarrier length (dynamically calculated) */
    csi_data_buff_t             *csi_data_buff;     /**< Pointer to CSI data buffer */
    bool                        lltf_bit_mode;      /**< LLTF bit mode flag */
} radar_ctx_t;

/**
 * @brief CSI data buffer index structure
 *
 * Represents a window index in the ring buffer, can be accessed as struct or 32-bit integer
 */
typedef struct {
    union {
        struct {
            uint8_t begin;      /**< Window start position in ring buffer */
            uint8_t end;        /**< Window end position in ring buffer */
            uint8_t window;     /**< Window size */
            uint8_t reserved;   /**< Reserved byte */
        };
        uint32_t data;         /**< Access as 32-bit integer */
    };
} csi_data_buff_index_t;

#define CSI_CORR_NUM              10
#define CSI_CORR_THRESHOLD        0.998f
#define RADAR_BUFF_NUM            3
#define RADAR_OUTLIERS_THRESHOLD  0.005f

/**
 * @brief Radar calibration status enumeration
 */
typedef enum {
    RADAR_CALIBRATE_NO = 0,         /**< No calibration */
    RADAR_CALIBRATE_PROGRESS,       /**< Calibration in progress */
    RADAR_CALIBRATE_COMPLETE,       /**< Calibration completed */
} radar_calibrate_status_t;

/**
 * @brief Radar calibration structure
 *
 * Stores calibration data and statistics for radar training and detection
 */
typedef struct {
    radar_calibrate_status_t calibrate_status;  /**< Current calibration status */
    float *data[CSI_CORR_NUM];                  /**< Array of training sample data pointers */
    size_t buff_size;                            /**< Buffer size for jitter calculation */
    float waveform_jitter_buff[RADAR_BUFF_NUM];  /**< Buffer for waveform jitter values */
    size_t data_num;                             /**< Number of training samples collected */
    float none_corr_sum;                         /**< Sum of correlation values for non-static environment */
    float none_corr_count;                       /**< Count of correlation values for non-static environment */
    float none_corr;                             /**< Current correlation value for non-static environment */
    float static_corr;                           /**< Static environment correlation value */
    uint16_t subcarrier_len;                     /**< Subcarrier length */
} radar_calibrate_t;

static radar_ctx_t s_ctx = {0};
static uint32_t s_csi_seq = 0;
static uint32_t s_pca_subcarrier_buff_num = 0;
static radar_calibrate_t *s_radar_calibrate = NULL;
static float s_waveform_wander_last = 0.0f;

static esp_err_t esp_radar_extract_rx_ctrl_info(const wifi_pkt_rx_ctrl_t *rx_ctrl, esp_radar_rx_ctrl_info_t *info)
{
    if (!rx_ctrl || !info) {
        return ESP_ERR_INVALID_ARG;
    }

#if CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C61
    info->rssi = rx_ctrl->rssi;
    info->rate = rx_ctrl->rate;
    info->rx_format = rx_ctrl->cur_bb_format;
    esp_csi_gain_ctrl_get_rx_gain(rx_ctrl, &info->agc_gain, &info->fft_gain);
    info->timestamp = rx_ctrl->timestamp;
    info->noise_floor = rx_ctrl->noise_floor;
    info->channel = rx_ctrl->channel;
    info->secondary_channel = rx_ctrl->second;
    switch (rx_ctrl->cur_bb_format) {
    case RX_FORMAT_11B:
    case RX_FORMAT_11G:  // RX_FORMAT_11A has the same value as RX_FORMAT_11G
        info->signal_mode = WIFI_SIGNAL_MODE_NON_HT;
        info->mcs = ((esp_wifi_htsig_t *)&rx_ctrl->he_siga1)->mcs;
        info->cwb = ((esp_wifi_htsig_t *)&rx_ctrl->he_siga1)->cbw;
        info->stbc = ((esp_wifi_htsig_t *)&rx_ctrl->he_siga1)->stbc;
        break;
    case RX_FORMAT_HT:
        info->signal_mode = WIFI_SIGNAL_MODE_HT;
        info->mcs = ((esp_wifi_htsig_t *)&rx_ctrl->he_siga1)->mcs;
        info->cwb = ((esp_wifi_htsig_t *)&rx_ctrl->he_siga1)->cbw;
        info->stbc = ((esp_wifi_htsig_t *)&rx_ctrl->he_siga1)->stbc;
        break;
    case RX_FORMAT_VHT:
        info->signal_mode = WIFI_SIGNAL_MODE_HT;
        info->mcs = ((esp_wifi_vht_siga1_t *)&rx_ctrl->he_siga1)->su_mcs;
        info->cwb = ((esp_wifi_vht_siga1_t *)&rx_ctrl->he_siga1)->cbw;
        info->stbc = ((esp_wifi_vht_siga1_t *)&rx_ctrl->he_siga1)->stbc;
        break;
    case RX_FORMAT_HE_SU:
        info->signal_mode = WIFI_SIGNAL_MODE_HE;
        info->mcs = ((esp_wifi_su_siga1_t *)&rx_ctrl->he_siga1)->he_mcs;
        info->cwb = ((esp_wifi_su_siga1_t *)&rx_ctrl->he_siga1)->bw;
        info->stbc = ((esp_wifi_su_siga2_t *)&rx_ctrl->he_siga2)->stbc;
        break;
    case RX_FORMAT_HE_MU:
        info->signal_mode = WIFI_SIGNAL_MODE_HE;
        info->mcs = ((esp_wifi_mu_siga1_t *)&rx_ctrl->he_siga1)->sigb_mcs;
        info->cwb = ((esp_wifi_mu_siga1_t *)&rx_ctrl->he_siga1)->bw;
        info->stbc = ((esp_wifi_mu_siga2_t *)&rx_ctrl->he_siga2)->stbc;
        break;
    default:
        return ESP_FAIL;
    }

#elif CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3
    info->rssi = rx_ctrl->rssi;
    info->rate = rx_ctrl->rate;
    info->rx_format = rx_ctrl->sig_mode;
    if (rx_ctrl->sig_mode == RX_FORMAT_NON_HT) {
        info->signal_mode = WIFI_SIGNAL_MODE_NON_HT;
    } else {
        info->signal_mode = WIFI_SIGNAL_MODE_HT;
    }
#if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2
    info->agc_gain = 0;
    info->fft_gain = 0;
#else
    esp_csi_gain_ctrl_get_rx_gain(rx_ctrl, &info->agc_gain, &info->fft_gain);
#endif
    info->timestamp = rx_ctrl->timestamp;
    info->noise_floor = rx_ctrl->noise_floor;
    info->channel = rx_ctrl->channel;
    info->secondary_channel = rx_ctrl->secondary_channel;
    info->mcs = rx_ctrl->mcs;
    info->cwb = rx_ctrl->cwb;
    info->stbc = rx_ctrl->stbc;
#endif
    return ESP_OK;
}

static esp_err_t esp_radar_mac_addr_filter(wifi_csi_info_t *info)
{
    static const char *TAG_FILTER = "esp_radar_filter";

    if ((!ADDR_IS_FULL(s_ctx.csi_config.filter_mac) &&  memcmp(info->mac, s_ctx.csi_config.filter_mac, 6) != 0)
#if WIFI_CSI_SEND_NULL_DATA_ENABLE
            || (ADDR_IS_EMPTY(s_ctx.csi_config.filter_mac) && info->payload_len != 14)
#endif
       ) {
        if ((ADDR_IS_EMPTY(s_ctx.csi_config.filter_mac) && info->payload_len != 14)) {
            ESP_LOGD(TAG_FILTER, "Not null data packet - payload_len: %d", info->payload_len);
            return ESP_FAIL;
        }
        ESP_LOGD(TAG_FILTER, "Source MAC mismatch - mac: " MACSTR ", filter_mac: " MACSTR,  MAC2STR(info->mac), MAC2STR(s_ctx.csi_config.filter_mac));
        return ESP_FAIL;
    }

    if (s_ctx.csi_config.filter_dmac_flag && memcmp(info->dmac, s_ctx.csi_config.filter_dmac, 6) != 0) {
        ESP_LOGD(TAG_FILTER, "Dest MAC mismatch - dmac: " MACSTR ", filter_dmac: " MACSTR, MAC2STR(info->dmac), MAC2STR(s_ctx.csi_config.filter_dmac));
        return ESP_FAIL;
    }

    return ESP_OK;
}

static esp_err_t esp_radar_check_timestamp_interval(uint32_t timestamp)
{
    static uint32_t s_last_timestamp = 0;

    uint32_t min_interval_us = s_ctx.csi_config.csi_recv_interval * 1000 / 5;

