md-asaduzzaman-shahin/esp32_csi_sensing_fall_detection/transmitter/managed_components/espressif__esp-radar/src/esp_radar.c
    if (timestamp - s_last_timestamp <= min_interval_us) {
        return ESP_FAIL;
    }

    s_last_timestamp = timestamp;
    return ESP_OK;
}

static void copy_subcarrier_data(wifi_csi_filtered_info_t *out_filtered_info, const int8_t *src_buf, const sub_carrier_range_t *range_array, uint16_t target_bytes, uint16_t *field_len)
{
    uint8_t i = 0;
    while (*field_len < target_bytes) {
        uint16_t size = range_array[i].stop - range_array[i].start;

        if (s_ctx.lltf_bit_mode) {
            int16_t *dest = (int16_t *)(out_filtered_info->valid_data + out_filtered_info->valid_len);
            const uint16_t *src = (const uint16_t *)(src_buf + range_array[i].start);
            for (uint16_t j = 0; j < size / 2; j++) {
                dest[j] = ((int16_t)(src[j] << 4)) >> 4;
            }
        } else {
            memcpy(out_filtered_info->valid_data + out_filtered_info->valid_len, src_buf + range_array[i].start, size);
        }

        *field_len += size;
        out_filtered_info->valid_len += size;
        i++;
    }
}

static esp_err_t esp_radar_rebuild_csi_data(const wifi_csi_info_t *info, const esp_radar_rx_ctrl_info_t *rx_ctrl_info, wifi_csi_filtered_info_t **out_filtered_info)
{
    static const char *TAG_FILTER_CSI = "esp_radar_csi_data_rebuild";
    if (!info || !rx_ctrl_info || !out_filtered_info) {
        return ESP_ERR_INVALID_ARG;
    }

    *out_filtered_info = NULL;

    for (size_t i = 0; i < sub_carrier_table_size; ++i) {
        bool int16_mismatch = (s_ctx.lltf_bit_mode && sub_carrier_table[i].total_bytes != info->len);

        bool int8_mismatch = (!s_ctx.lltf_bit_mode &&
                              (rx_ctrl_info->signal_mode != sub_carrier_table[i].signal_mode ||
                               rx_ctrl_info->cwb != sub_carrier_table[i].channel_bandwidth ||
                               rx_ctrl_info->stbc != sub_carrier_table[i].stbc
#if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3
                               || rx_ctrl_info->secondary_channel != sub_carrier_table[i].second
#endif
                              ));

        if (int16_mismatch || int8_mismatch) {
            continue;
        }

        const csi_sub_carrier_table_t *sub_carrier_index =  sub_carrier_table + i;
        *out_filtered_info = RADAR_MALLOC_RETRY(sizeof(wifi_csi_filtered_info_t) + sub_carrier_index->valid_bytes);
        memset(*out_filtered_info, 0, sizeof(wifi_csi_filtered_info_t) + sub_carrier_index->valid_bytes);

        wifi_csi_filtered_info_t *filtered_info = *out_filtered_info;

        filtered_info->rx_ctrl_info = *rx_ctrl_info;
        filtered_info->data_type = s_ctx.lltf_bit_mode ? WIFI_CSI_DATA_TYPE_INT16 : WIFI_CSI_DATA_TYPE_INT8;
        filtered_info->raw_data = info->buf;
        filtered_info->raw_len  = info->len;
        memcpy(filtered_info->mac, info->mac, 6);
        memcpy(filtered_info->dmac, info->dmac, 6);

        if (sub_carrier_index->lltf_bytes > 0) {
            copy_subcarrier_data(filtered_info, info->buf, sub_carrier_index->lltf,
                                 sub_carrier_index->lltf_bytes, &filtered_info->valid_lltf_len);
        }

        if (sub_carrier_index->ht_ltf_bytes > 0) {
            copy_subcarrier_data(filtered_info, info->buf, sub_carrier_index->ht_ltf,
                                 sub_carrier_index->ht_ltf_bytes, &filtered_info->valid_ht_ltf_len);
        }

        if (sub_carrier_index->stbc_ht_ltf_bytes > 0) {
            copy_subcarrier_data(filtered_info, info->buf, sub_carrier_index->stbc_ht_ltf,
                                 sub_carrier_index->stbc_ht_ltf_bytes, &filtered_info->valid_stbc_ht_ltf_len);
        }
#if CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C61
        if (sub_carrier_index->he_ltf_bytes > 0) {
            copy_subcarrier_data(filtered_info, info->buf, sub_carrier_index->he_ltf,
                                 sub_carrier_index->he_ltf_bytes, &filtered_info->valid_he_ltf_len);
        }
        if (sub_carrier_index->stbc_he_ltf_bytes > 0) {
            copy_subcarrier_data(filtered_info, info->buf, sub_carrier_index->stbc_he_ltf,
                                 sub_carrier_index->stbc_he_ltf_bytes, &filtered_info->valid_stbc_he_ltf_len);
        }
#endif

        ESP_LOGD(TAG_FILTER_CSI, "raw_len: %d, valid_len: %d, valid_lltf_len: %d, valid_ht_ltf_len: %d, valid_stbc_ht_ltf_len: %d"
#if CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C61
                 ", valid_he_ltf_len: %d, valid_stbc_he_ltf_len: %d"
#endif
                 , filtered_info->raw_len, filtered_info->valid_len, filtered_info->valid_lltf_len, filtered_info->valid_ht_ltf_len, filtered_info->valid_stbc_ht_ltf_len
#if CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C61
                 , filtered_info->valid_he_ltf_len, filtered_info->valid_stbc_he_ltf_len
#endif
                );
        return ESP_OK;
    }

    ESP_LOGW(TAG_FILTER_CSI, "value fail, len: %d, secondary_channel: %d, sig_mode: %d, cwb: %d, stbc: %d",
             info->len, rx_ctrl_info->secondary_channel, rx_ctrl_info->rx_format, rx_ctrl_info->cwb, rx_ctrl_info->stbc);

    return ESP_FAIL;
}

static void esp_radar_csi_rx_cb(void *ctx, wifi_csi_info_t *info)
{
    static const char *TAG_CB = "esp_radar_csi_rx_cb";
    if (!info || !info->buf) {
        ESP_LOGE(TAG_CB, "<%s> esp_radar_csi_rx_cb", esp_err_to_name(ESP_ERR_INVALID_ARG));
        return;
    }

    if (esp_radar_mac_addr_filter(info) != ESP_OK) {
        return;
    }

    esp_radar_rx_ctrl_info_t rx_ctrl_info;
    esp_radar_extract_rx_ctrl_info(&info->rx_ctrl, &rx_ctrl_info);
    ESP_LOGD(TAG_CB, "timestamp: %ld, mac: " MACSTR", channel: %d, secondary_channel: %d, rssi: %d, rx_format: %d, cwb: %d, rate: %d, mcs: %d, stbc: %d, noise_floor: %d, len: %d, agc_gain: %d, fft_gain: %d",
             rx_ctrl_info.timestamp, MAC2STR(info->mac), rx_ctrl_info.channel, rx_ctrl_info.secondary_channel, rx_ctrl_info.rssi, rx_ctrl_info.rx_format, rx_ctrl_info.cwb, rx_ctrl_info.rate, rx_ctrl_info.mcs,
             rx_ctrl_info.stbc, rx_ctrl_info.noise_floor, info->len, rx_ctrl_info.agc_gain, rx_ctrl_info.fft_gain);

