md-asaduzzaman-shahin/esp32_csi_sensing_fall_detection/transmitter/managed_components/espressif__esp-radar/src/esp_radar.c
    wifi_csi_filtered_info_t *filtered_info = NULL;
    ESP_RETURN_VOID_ON_ERROR(esp_radar_rebuild_csi_data(info, &rx_ctrl_info, &filtered_info), TAG_CB, "Failed to filter CSI data");

    uint32_t seq = s_csi_seq++;
    filtered_info->seq_id = seq;
    filtered_info->info = info;

    float compensate_gain = 0;
#if WIFI_CSI_PHY_GAIN_ENABLE
    esp_csi_gain_ctrl_record_rx_gain(rx_ctrl_info.agc_gain, rx_ctrl_info.fft_gain);
    if (s_ctx.csi_config.csi_compensate_en) {
        bool samples_are_16bit = (filtered_info->data_type == WIFI_CSI_DATA_TYPE_INT16);
        esp_csi_gain_ctrl_compensate_rx_gain(filtered_info->valid_data, filtered_info->valid_len, samples_are_16bit,
                                             &compensate_gain, rx_ctrl_info.agc_gain, rx_ctrl_info.fft_gain);
    }
#endif
    filtered_info->rx_gain_compensation = compensate_gain;
    if (s_ctx.csi_config.csi_filtered_cb) {
        s_ctx.csi_config.csi_filtered_cb(s_ctx.csi_config.csi_filtered_cb_ctx, filtered_info);
    }
    if (!s_ctx.run_flag) {
        static bool run_flag_warned = false;
        if (!run_flag_warned) {
            ESP_LOGW(TAG_CB, "esp_radar not running, CSI data dropped");
        }
        RADAR_FREE(filtered_info);
    } else if (!s_ctx.csi_info_queue || xQueueSend(s_ctx.csi_info_queue, &filtered_info, 0) == pdFALSE) {
        ESP_LOGW(TAG_CB, "Failed to send CSI data to queue, data dropped");
        RADAR_FREE(filtered_info);
    }
}
#define my_hypotf(a, b) sqrtf((a) * (a) + (b) * (b))

static esp_err_t esp_radar_get_ltf_data(const wifi_csi_filtered_info_t *filtered_info, void **data_ptr, uint16_t *data_len)
{
    if (!filtered_info || !data_ptr || !data_len) {
        return ESP_ERR_INVALID_ARG;
    }

    uint8_t *ptr = (uint8_t *)filtered_info->valid_data;
    uint16_t offset = 0;

    switch (s_ctx.dec_config.ltf_type) {
    case RADAR_LTF_TYPE_LLTF:
        *data_ptr = ptr;
        *data_len = filtered_info->valid_lltf_len;
        break;

    case RADAR_LTF_TYPE_HTLTF:
        offset = filtered_info->valid_lltf_len;
        *data_ptr = ptr + offset;
        *data_len = filtered_info->valid_ht_ltf_len;
        break;

    case RADAR_LTF_TYPE_STBC_HTLTF:
        offset = filtered_info->valid_lltf_len + filtered_info->valid_ht_ltf_len;
        *data_ptr = ptr + offset;
        *data_len = filtered_info->valid_stbc_ht_ltf_len;
        break;

#if CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C61
    case RADAR_LTF_TYPE_HELTF:
        offset = filtered_info->valid_lltf_len + filtered_info->valid_ht_ltf_len +
                 filtered_info->valid_stbc_ht_ltf_len;
        *data_ptr = ptr + offset;
        *data_len = filtered_info->valid_he_ltf_len;
        break;

    case RADAR_LTF_TYPE_STBC_HELTF:
        offset = filtered_info->valid_lltf_len + filtered_info->valid_ht_ltf_len +
                 filtered_info->valid_stbc_ht_ltf_len + filtered_info->valid_he_ltf_len;
        *data_ptr = ptr + offset;
        *data_len = filtered_info->valid_stbc_he_ltf_len;
        break;
#endif

    default:
        ESP_LOGE(TAG, "Unsupported LTF type: %d", s_ctx.dec_config.ltf_type);
        return ESP_ERR_NOT_SUPPORTED;
    }

    if (*data_len == 0) {
        ESP_LOGW(TAG, "LTF type %d has no data", s_ctx.dec_config.ltf_type);
        return ESP_ERR_NOT_FOUND;
    }

    return ESP_OK;
}

static esp_err_t csi_outlier_filter_process(uint16_t subcarrier_len)
{
    const uint8_t threshold = s_ctx.dec_config.outliers_threshold;
    uint32_t curr_seq = s_ctx.window_ctx.next_seq;
    const uint8_t max_streak = 3;
    static uint8_t outlier_streak = 0;
    if (curr_seq < 3) {
        outlier_streak = 0;
        return ESP_OK;
    }

    float *hist0 = s_ctx.csi_data_buff->amplitude[(curr_seq - 3) % s_ctx.window_ctx.buff_size];
    float *hist1 = s_ctx.csi_data_buff->amplitude[(curr_seq - 2) % s_ctx.window_ctx.buff_size];
    float *hist2 = s_ctx.csi_data_buff->amplitude[(curr_seq - 1) % s_ctx.window_ctx.buff_size];
    float *curr  = s_ctx.csi_data_buff->amplitude[curr_seq % s_ctx.window_ctx.buff_size];

    uint32_t outliers_count = 0;

    for (int i = 0; i < subcarrier_len; ++i) {
        float ref = (hist0[i] + hist1[i] + hist2[i]) / 3.0f;
        float diff = curr[i] - ref;

        if (diff > threshold || diff < -threshold) {
            outliers_count++;
        }
    }
    bool is_outlier_frame = (outliers_count >= subcarrier_len / 2);

    if (!is_outlier_frame) {
        outlier_streak = 0;
        return ESP_OK;
    }
    outlier_streak++;

    if (outlier_streak >= max_streak) {
        ESP_LOGW(TAG, "Consecutive outliers (%u), accept as new baseline, seq=%lu", outlier_streak, curr_seq);
        outlier_streak = 0;
        return ESP_OK;
    }
    ESP_LOGD(TAG, "Soft-updated outlier frame: %lu/%d at seq=%lu", outliers_count, subcarrier_len, curr_seq);

    return ESP_OK;
}

static esp_err_t csi_window_update(csi_data_buff_index_t *buff_index)
{
    if (!s_ctx.csi_data_buff || s_ctx.window_ctx.buff_size == 0) {
        return ESP_FAIL;
    }

    buff_index->begin  = s_ctx.window_ctx.window_start_seq % s_ctx.window_ctx.buff_size;
    buff_index->end    = s_ctx.window_ctx.next_seq % s_ctx.window_ctx.buff_size;
    buff_index->window = s_ctx.window_ctx.next_seq - s_ctx.window_ctx.window_start_seq;

    int32_t spent_time = s_ctx.csi_data_buff->timestamp[buff_index->end] - s_ctx.csi_data_buff->timestamp[buff_index->begin];
    int32_t time_tamp  = s_ctx.csi_data_buff->timestamp[buff_index->end] - (int32_t)(s_ctx.window_ctx.last_timestamp);

    esp_err_t ret = ESP_FAIL;

    if (time_tamp < 0 || time_tamp > (int32_t)(s_ctx.dec_config.csi_handle_time / 2)) {
        ESP_LOGW(TAG, "time_tamp: %d, spent_time: %d,csi_handle_time: %d, end: %d, last: %d, window: %d,handle_window: %d",
                 time_tamp, spent_time, s_ctx.dec_config.csi_handle_time, s_ctx.csi_data_buff->timestamp[buff_index->end], s_ctx.window_ctx.last_timestamp,
                 buff_index->window, s_ctx.window_ctx.handle_window);

