md-asaduzzaman-shahin/esp32_csi_sensing_fall_detection/transmitter/managed_components/espressif__esp-radar/src/esp_radar.c
        if (buff_index->window > s_ctx.window_ctx.handle_window / 3) {
            buff_index->window--;
            buff_index->end = (s_ctx.window_ctx.next_seq - 1) % s_ctx.window_ctx.buff_size;
            ret = ESP_OK;
        }
        s_ctx.window_ctx.window_start_seq = s_ctx.window_ctx.next_seq;
        goto UPDATE_STATE;
    }

    if (spent_time >= (int32_t)(s_ctx.dec_config.csi_handle_time * 2) || buff_index->window >= s_ctx.window_ctx.handle_window / 2) {
        if (buff_index->window < s_ctx.window_ctx.handle_window / 3) {
            s_ctx.window_ctx.window_start_seq = s_ctx.window_ctx.next_seq;
            ESP_LOGW(TAG, "buff_index.window: %d, spent_time: %d, csi_handle_time: %d, handle_window: %d",
                     buff_index->window, spent_time, s_ctx.dec_config.csi_handle_time, s_ctx.window_ctx.handle_window);
            goto UPDATE_STATE;
        }
        ESP_LOGD(TAG, "buff_index.window: %d, time_tamp: %d, spent_time: %d, csi_handle_time: %d, handle_window: %d,buff_index-begin: %d, buff_index-end: %d",
                 buff_index->window, time_tamp, spent_time, s_ctx.dec_config.csi_handle_time, s_ctx.window_ctx.handle_window, buff_index->begin, buff_index->end);
        ret = ESP_OK;
        s_ctx.window_ctx.window_start_seq += buff_index->window / 2;
    }

UPDATE_STATE:
    s_ctx.window_ctx.last_timestamp = s_ctx.csi_data_buff->timestamp[buff_index->end];
    s_ctx.window_ctx.next_seq++;
    return ret;
}

static void csi_prepare_amplitude(uint16_t subcarrier_len)
{
    size_t pointer_bytes = (size_t)s_ctx.window_ctx.buff_size * sizeof(float *);
    size_t data_bytes    = (size_t)s_ctx.window_ctx.buff_size * subcarrier_len * sizeof(float);
    size_t total_bytes   = pointer_bytes + data_bytes;
    uint8_t *amplitude_block = RADAR_MALLOC_RETRY(total_bytes);
    memset(amplitude_block, 0, total_bytes);

    s_ctx.csi_data_buff->amplitude = (float **)amplitude_block;
    float *data_base = (float *)(amplitude_block + pointer_bytes);
    for (uint32_t i = 0; i < s_ctx.window_ctx.buff_size; i++) {
        s_ctx.csi_data_buff->amplitude[i] = data_base + (i * subcarrier_len);
    }
}

static void csi_write_frame_to_ring(const void *ltf_data, uint16_t subcarrier_len, wifi_csi_filtered_info_t *filtered_info)
{
    if (!s_ctx.csi_data_buff || !s_ctx.csi_data_buff->amplitude ||
            !s_ctx.csi_data_buff->seq_id || !s_ctx.csi_data_buff->timestamp) {
        return;
    }

    uint32_t write_index = s_ctx.window_ctx.next_seq % s_ctx.window_ctx.buff_size;

    s_ctx.csi_data_buff->seq_id[write_index] = filtered_info->seq_id;
    s_ctx.csi_data_buff->timestamp[write_index] = filtered_info->rx_ctrl_info.timestamp / 1000;

    float *csi_data = s_ctx.csi_data_buff->amplitude[write_index];
    const uint8_t step = s_ctx.dec_config.sub_carrier_step_size;
    const uint8_t *data = (const uint8_t *)ltf_data;

    for (int i = 0; i < subcarrier_len; i++) {
        if (filtered_info->data_type == WIFI_CSI_DATA_TYPE_INT16) {
            /* Extract 12-bit signed values from packed format:
             * Data format: [low_byte_0, high_byte_0, low_byte_1, high_byte_1, ...]
             * Each 12-bit value is sign-extended: left shift 4 bits then arithmetic right shift 4 bits
             */
            int16_t imag = ((int16_t)(((int16_t)data[i * step * 4 + 1]) << 12) >> 4 | (uint8_t)data[i * step * 4]) >> 4;
            int16_t real = ((int16_t)(((int16_t)data[i * step * 4 + 3]) << 12) >> 4 | (uint8_t)data[i * step * 4 + 2]) >> 4;
            csi_data[i] = my_hypotf(real, imag);
        } else {
            csi_data[i] = my_hypotf(((const int8_t *)ltf_data)[i * step * 2], ((const int8_t *)ltf_data)[i * step * 2 + 1]);
        }
    }
}

static void csi_preprocessing_task(void *arg)
{
    wifi_csi_filtered_info_t *filtered_info = NULL;

    while (xQueueReceive(s_ctx.csi_info_queue, &filtered_info, portMAX_DELAY) && s_ctx.run_flag) {
        void *ltf_data = NULL;
        uint16_t ltf_len = 0;
        uint16_t subcarrier_len = 0;
        if (esp_radar_get_ltf_data(filtered_info, &ltf_data, &ltf_len) != ESP_OK) {
            goto FREE_MEM;
        }

        uint8_t component_bytes = (filtered_info->data_type == WIFI_CSI_DATA_TYPE_INT16) ? sizeof(int16_t) : sizeof(int8_t);
        subcarrier_len = (uint16_t)((ltf_len / (2U * component_bytes)) / s_ctx.dec_config.sub_carrier_step_size);
        if (s_ctx.subcarrier_len == 0) {
            s_ctx.subcarrier_len = subcarrier_len;
            csi_prepare_amplitude(subcarrier_len);
            ESP_LOGI(TAG, "First frame detected: type=%d, LTF length=%d, subcarrier length=%d, step size=%d, allocated buffer: %d x %d",
                     s_ctx.dec_config.ltf_type, ltf_len, subcarrier_len, s_ctx.dec_config.sub_carrier_step_size, s_ctx.window_ctx.buff_size, subcarrier_len);
        } else if (subcarrier_len != s_ctx.subcarrier_len) {
            ESP_LOGE(TAG, "Frame length mismatch detected! Expected type=%d, subcarrier_len=%d, got=%d (LTF len=%d). Discarding frame.",
                     s_ctx.dec_config.ltf_type, s_ctx.subcarrier_len, subcarrier_len, ltf_len);
            goto FREE_MEM;
        }

        csi_write_frame_to_ring(ltf_data, subcarrier_len, filtered_info);
        if (s_ctx.dec_config.outliers_threshold > 0) {
            if (csi_outlier_filter_process(subcarrier_len) != ESP_OK) {
                goto FREE_MEM;
            }
        }

        csi_data_buff_index_t buff_index = {0};
        if (csi_window_update(&buff_index) == ESP_OK) {
            if (!s_ctx.csi_data_queue || xQueueSend(s_ctx.csi_data_queue, &buff_index, portMAX_DELAY) == pdFALSE) {
                ESP_LOGW(TAG, "The buffer is full");
            }
        }

FREE_MEM:
        RADAR_FREE(filtered_info);
    }

    ESP_LOGW(TAG, "csi_preprocessing_task exit");
    xEventGroupSetBits(s_ctx.task_exit_group, CSI_PREPROCESSING_EXIT_BIT);
    vTaskDelete(NULL);
}

static void radar_calibrate_free_entries(radar_calibrate_t *cal)
{
    if (!cal) {
        return;
    }
    for (int i = 0; i < CSI_CORR_NUM; ++i) {
        if (cal->data[i]) {
            RADAR_FREE(cal->data[i]);
            cal->data[i] = NULL;
        }
    }
}

static void radar_calibrate_reset_stats(radar_calibrate_t *cal)
{
    if (!cal) {
        return;
    }

    cal->buff_size = 0;
    cal->none_corr_sum = 0.0f;
    cal->none_corr_count = 0.0f;
    cal->none_corr = 1.0f;
    cal->static_corr = 1.0f;
    cal->subcarrier_len = 0;
}

esp_err_t esp_radar_train_start(void)
{
    if (!s_radar_calibrate) {
        s_radar_calibrate = RADAR_MALLOC_RETRY(sizeof(radar_calibrate_t));
        memset(s_radar_calibrate, 0, sizeof(radar_calibrate_t));
        s_radar_calibrate->data_num = 0;
    }

    radar_calibrate_reset_stats(s_radar_calibrate);
    s_radar_calibrate->calibrate_status = RADAR_CALIBRATE_PROGRESS;
    s_waveform_wander_last = 0.0f;
    s_pca_subcarrier_buff_num = 0;
    ESP_LOGI(TAG_TRAIN, "esp_radar_train_start");
    return ESP_OK;
}

esp_err_t esp_radar_train_remove(void)
{
    if (!s_radar_calibrate) {
        return ESP_OK;
    }

