md-asaduzzaman-shahin/esp32_csi_sensing_fall_detection/transmitter/managed_components/espressif__esp-radar/src/esp_radar.c
    radar_calibrate_free_entries(s_radar_calibrate);
    radar_calibrate_reset_stats(s_radar_calibrate);
    s_radar_calibrate->data_num = 0;
    s_radar_calibrate->calibrate_status = RADAR_CALIBRATE_NO;
    s_waveform_wander_last = 0.0f;
    ESP_LOGI(TAG_TRAIN, "esp_radar_train_remove");
    return ESP_OK;
}

esp_err_t esp_radar_train_stop(float *wander_threshold, float *jitter_threshold)
{
    if (!s_radar_calibrate) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    if (!s_radar_calibrate->data_num || s_radar_calibrate->none_corr_count == 0.0f) {
        return ESP_ERR_INVALID_STATE;
    }

    s_radar_calibrate->calibrate_status = RADAR_CALIBRATE_COMPLETE;

    if (wander_threshold) {
        *wander_threshold = 1.0f - (s_radar_calibrate->none_corr_sum / s_radar_calibrate->none_corr_count);
    }
    if (jitter_threshold) {
        *jitter_threshold = 1.0f - s_radar_calibrate->static_corr;
    }

    ESP_LOGI(TAG_TRAIN, "esp_radar_train_stop");
    return ESP_OK;
}

static esp_err_t csi_detection_compute_pca(uint16_t cols, const csi_data_buff_index_t *buff_index, float *pca_subcarrier_buff_current)
{
    float (*csi_data_0)[cols] = (float (*)[cols])s_ctx.csi_data_buff->amplitude[buff_index->begin];
    float (*csi_data_1)[cols] = (float (*)[cols])s_ctx.csi_data_buff->amplitude[0];

    uint16_t csi_data_0_len = (buff_index->begin <= buff_index->end) ? buff_index->window : (s_ctx.window_ctx.buff_size - buff_index->begin);
    uint16_t csi_data_1_len = buff_index->window - csi_data_0_len;

    if (csi_data_0_len == 0) {
        return ESP_FAIL;
    }

    return pca(cols, csi_data_0_len, csi_data_0, csi_data_1_len, csi_data_1, pca_subcarrier_buff_current);
}

static void csi_detection_update_waveform_metrics(wifi_radar_info_t *radar_info, float *pca_subcarrier_buff_current, float **pca_subcarrier_buff, uint16_t cols)
{
    uint8_t move_buffer_size = s_ctx.dec_config.pca_window_size;
    if (s_pca_subcarrier_buff_num < move_buffer_size) {
        return;
    }

    radar_info->waveform_jitter = 0.0f;

    for (int i = 0; i < move_buffer_size - 1; ++i) {
        float corr_val = fabs(corr(pca_subcarrier_buff_current, pca_subcarrier_buff[(s_pca_subcarrier_buff_num - 2 - i) % move_buffer_size], cols));

        if (radar_info->waveform_jitter < corr_val) {
            radar_info->waveform_jitter = corr_val;
        }
    }

}

static void csi_detection_compute_wander(wifi_radar_info_t *radar_info, float *pca_subcarrier_buff_current, uint16_t cols)
{
    if (s_radar_calibrate->data_num == 0) {
        radar_info->waveform_wander = 1.0f;
        return;
    }

    radar_info->waveform_wander = 0.0f;
    for (size_t i = 0; i < s_radar_calibrate->data_num && i < CSI_CORR_NUM; ++i) {
        float *record = s_radar_calibrate->data[i % CSI_CORR_NUM];
        if (!record) {
            continue;
        }
        float corr_val = fabs(corr(record, pca_subcarrier_buff_current, cols));
        if (radar_info->waveform_wander < corr_val) {
            radar_info->waveform_wander = corr_val;
        }
    }
}

static void csi_training_collect_sample(wifi_radar_info_t *radar_info, float **pca_subcarrier_buff, uint16_t cols)
{
    uint8_t move_buffer_size = s_ctx.dec_config.pca_window_size;

    size_t idx_first = (s_radar_calibrate->buff_size + RADAR_BUFF_NUM - 2) % RADAR_BUFF_NUM;
    size_t idx_second = (s_radar_calibrate->buff_size + RADAR_BUFF_NUM - 1) % RADAR_BUFF_NUM;
    size_t idx_third = s_radar_calibrate->buff_size % RADAR_BUFF_NUM;

    s_radar_calibrate->waveform_jitter_buff[idx_third] = radar_info->waveform_jitter;
    s_radar_calibrate->buff_size++;

    if (s_radar_calibrate->buff_size < RADAR_BUFF_NUM) {
        return;
    }

    float first = s_radar_calibrate->waveform_jitter_buff[idx_first];
    float second = s_radar_calibrate->waveform_jitter_buff[idx_second];
    float third = s_radar_calibrate->waveform_jitter_buff[idx_third];

    if ((first - second > RADAR_OUTLIERS_THRESHOLD) && (third - second > RADAR_OUTLIERS_THRESHOLD)) {
        ESP_LOGI(TAG_TRAIN, "Jitter outlier detected: %.4f < %.4f, %.4f", second, first, third);
        return;
    }

    if (s_radar_calibrate->static_corr > radar_info->waveform_jitter) {
        s_radar_calibrate->static_corr = second;
    }

    if (s_waveform_wander_last < CSI_CORR_THRESHOLD) {
        float *pca_prev = pca_subcarrier_buff[(s_pca_subcarrier_buff_num + move_buffer_size - 2) % move_buffer_size];
        if (pca_prev) {
            size_t index = s_radar_calibrate->data_num % CSI_CORR_NUM;

            if (!s_radar_calibrate->data[index]) {
                s_radar_calibrate->data[index] = RADAR_MALLOC_RETRY((size_t)cols * sizeof(float));
            }

            memcpy(s_radar_calibrate->data[index], pca_prev, (size_t)cols * sizeof(float));
            s_radar_calibrate->data_num++;
            s_radar_calibrate->none_corr = 1.0f;
            radar_info->waveform_wander = 1.0f;

            ESP_LOGI(TAG_TRAIN, "Training sample collected: num=%zu, corr=%.4f",
                     s_radar_calibrate->data_num, s_waveform_wander_last);
        }
    } else {
        s_radar_calibrate->none_corr = s_waveform_wander_last;
        if (s_waveform_wander_last < 0.99999f) {
            s_radar_calibrate->none_corr_sum += s_waveform_wander_last;
            s_radar_calibrate->none_corr_count += 1.0f;

            ESP_LOGI(TAG_TRAIN, "Training stats: sum=%.4f, count=%.0f, avg=%.4f",
                     s_radar_calibrate->none_corr_sum, s_radar_calibrate->none_corr_count,
                     s_radar_calibrate->none_corr_sum / s_radar_calibrate->none_corr_count);
        }
    }

    s_waveform_wander_last = radar_info->waveform_wander;
}

static void csi_detection_task(void *arg)
{
    uint8_t move_buffer_size = s_ctx.dec_config.pca_window_size;
    float **pca_subcarrier_buff = RADAR_MALLOC_RETRY(move_buffer_size * sizeof(float *));
    memset(pca_subcarrier_buff, 0, move_buffer_size * sizeof(float *));
    uint16_t cols = 0;
    bool pca_buff_allocated = false;
    csi_data_buff_index_t buff_index = {0};

    while (xQueueReceive(s_ctx.csi_data_queue, &buff_index, portMAX_DELAY) && s_ctx.run_flag) {
        cols = s_ctx.subcarrier_len;
        if (!s_ctx.csi_data_buff->amplitude || cols == 0) {
            ESP_LOGW(TAG_DETECTION, "CSI buffer not ready");
            continue;
        }

