md-asaduzzaman-shahin/esp32_csi_sensing_fall_detection/transmitter/managed_components/espressif__esp-radar/src/esp_radar.c
        if (!pca_buff_allocated) {
            for (int i = 0; i < move_buffer_size; ++i) {
                pca_subcarrier_buff[i] = RADAR_MALLOC_RETRY(cols * sizeof(float));
            }
            pca_buff_allocated = true;
            ESP_LOGI(TAG_DETECTION, "Allocated PCA subcarrier buffer: %d x %d", move_buffer_size, cols);
        }

        wifi_radar_info_t radar_info = {
            .waveform_jitter = 1,
            .waveform_wander = 1,
        };

        uint32_t timestamp_start = esp_log_timestamp();

        float *pca_subcarrier_buff_current = pca_subcarrier_buff[s_pca_subcarrier_buff_num % move_buffer_size];

        if (csi_detection_compute_pca(cols, &buff_index, pca_subcarrier_buff_current) != ESP_OK) {
            ESP_LOGW(TAG_DETECTION, "PCA calculation failed");
            continue;
        }
        s_pca_subcarrier_buff_num++;

        csi_detection_update_waveform_metrics(&radar_info, pca_subcarrier_buff_current, pca_subcarrier_buff, cols);

        if (s_radar_calibrate) {
            if (s_radar_calibrate->subcarrier_len == 0) {
                s_radar_calibrate->subcarrier_len = cols;
            } else if (s_radar_calibrate->subcarrier_len != cols) {
                ESP_LOGW(TAG_TRAIN, "Subcarrier length changed from %u to %u, reset training data",
                         s_radar_calibrate->subcarrier_len, cols);
                esp_radar_train_remove();
                s_radar_calibrate->subcarrier_len = cols;
            }

            csi_detection_compute_wander(&radar_info, pca_subcarrier_buff_current, cols);

            if (s_radar_calibrate->calibrate_status == RADAR_CALIBRATE_PROGRESS && s_pca_subcarrier_buff_num >= 2) {
                csi_training_collect_sample(&radar_info, pca_subcarrier_buff, cols);
            }
        }

        radar_info.waveform_wander = 1.0f - radar_info.waveform_wander;
        radar_info.waveform_jitter = 1.0f - radar_info.waveform_jitter;

        int32_t time_spent  = s_ctx.csi_data_buff->timestamp[buff_index.end] - s_ctx.csi_data_buff->timestamp[buff_index.begin];
        if (time_spent > 0) {
            ESP_LOGD(TAG_DETECTION, "det_time: %u/%u, free_heap: %d, wander: %f, jitter: %f, window: %d, begin: %d, end: %d, freq: %dHz",
                     time_spent, esp_log_timestamp() - timestamp_start, esp_get_free_heap_size(),
                     radar_info.waveform_wander, radar_info.waveform_jitter, buff_index.window,
                     buff_index.begin, buff_index.end, buff_index.window * 1000 / time_spent);
        }

        if (s_ctx.dec_config.wifi_radar_cb) {
            s_ctx.dec_config.wifi_radar_cb(s_ctx.dec_config.wifi_radar_cb_ctx, &radar_info);
        }
    }

    for (int i = 0; i < move_buffer_size; ++i) {
        if (pca_subcarrier_buff[i]) {
            RADAR_FREE(pca_subcarrier_buff[i]);
        }
    }
    RADAR_FREE(pca_subcarrier_buff);
    s_pca_subcarrier_buff_num = 0;
    ESP_LOGW(TAG_DETECTION, "csi_detection_task  exit");
    xEventGroupSetBits(s_ctx.task_exit_group, CSI_DETECTION_EXIT_BIT);
    vTaskDelete(NULL);
}
esp_err_t esp_radar_start()
{
    if (s_ctx.run_flag) {
        return ESP_OK;
    }

    s_ctx.run_flag = true;
    s_csi_seq = 0;

    s_ctx.csi_data_buff = RADAR_MALLOC_RETRY(sizeof(csi_data_buff_t));
    memset(s_ctx.csi_data_buff, 0, sizeof(csi_data_buff_t));

    s_ctx.csi_info_queue = xQueueCreate(5, sizeof(void *));
    s_ctx.csi_data_queue = xQueueCreate(1, sizeof(csi_data_buff_index_t));
    s_ctx.task_exit_group  = xEventGroupCreate();
    if (s_ctx.dec_config.csi_handle_time < s_ctx.csi_config.csi_recv_interval * (s_ctx.dec_config.pca_window_size)) {
        ESP_LOGE(TAG, "csi_handle_time is too short, will set to %d", s_ctx.csi_config.csi_recv_interval * (s_ctx.dec_config.pca_window_size));
        s_ctx.dec_config.csi_handle_time = s_ctx.csi_config.csi_recv_interval * (s_ctx.dec_config.pca_window_size);
    }
    s_ctx.window_ctx.handle_window     = (s_ctx.dec_config.csi_handle_time / s_ctx.csi_config.csi_recv_interval) * 2;
    s_ctx.window_ctx.buff_size         = (s_ctx.dec_config.csi_handle_time / s_ctx.csi_config.csi_recv_interval) * 2 + 20;
    s_ctx.window_ctx.window_start_seq  = 0;
    s_ctx.window_ctx.next_seq          = 0;
    s_ctx.window_ctx.last_timestamp    = 0;

    ESP_LOGI(TAG, "[%s, %d] csi_recv_interval: %d, csi_handle_time: %d, csi_handle_window: %d, csi_handle_buffer: %d",
             __func__, __LINE__,
             s_ctx.csi_config.csi_recv_interval, s_ctx.dec_config.csi_handle_time,
             s_ctx.window_ctx.handle_window, s_ctx.window_ctx.buff_size);

    s_ctx.csi_data_buff->amplitude = NULL;
    s_ctx.csi_data_buff->timestamp = RADAR_MALLOC_RETRY(s_ctx.window_ctx.buff_size * sizeof(uint32_t));
    memset(s_ctx.csi_data_buff->timestamp, 0, s_ctx.window_ctx.buff_size * sizeof(uint32_t));
    s_ctx.csi_data_buff->seq_id = RADAR_MALLOC_RETRY(s_ctx.window_ctx.buff_size * sizeof(uint32_t));
    memset(s_ctx.csi_data_buff->seq_id, 0, s_ctx.window_ctx.buff_size * sizeof(uint32_t));

    xTaskCreate(csi_detection_task, "csi_handle", 3 * 1024, NULL, s_ctx.dec_config.csi_handle_priority, NULL);
    xTaskCreate(csi_preprocessing_task, "csi_combine", 3 * 1024, NULL, s_ctx.dec_config.csi_combine_priority, NULL);

    return ESP_OK;
}

esp_err_t esp_radar_stop()
{
    csi_data_buff_index_t buff_index = {0};
    wifi_csi_filtered_info_t *filtered_info = NULL;
    s_ctx.run_flag = false;
    xQueueSend(s_ctx.csi_info_queue, &filtered_info, 0);
    xQueueSend(s_ctx.csi_data_queue, &buff_index, 0);

    xEventGroupWaitBits(s_ctx.task_exit_group, CSI_DETECTION_EXIT_BIT | CSI_PREPROCESSING_EXIT_BIT,
                        pdTRUE, pdTRUE, portMAX_DELAY);

    if (s_ctx.csi_info_queue) {
        while (xQueueReceive(s_ctx.csi_info_queue, &filtered_info, 0)) {
            if (filtered_info) {
                RADAR_FREE(filtered_info);
            }
        }
    }

    if (s_ctx.csi_data_queue) {
        while (xQueueReceive(s_ctx.csi_data_queue, &buff_index, 0)) ;

        if (s_ctx.csi_data_buff) {
            RADAR_FREE(s_ctx.csi_data_buff->amplitude);
            RADAR_FREE(s_ctx.csi_data_buff->timestamp);
            RADAR_FREE(s_ctx.csi_data_buff->seq_id);
            RADAR_FREE(s_ctx.csi_data_buff);
            s_ctx.csi_data_buff = NULL;
            s_ctx.subcarrier_len = 0;
        }
        vQueueDelete(s_ctx.csi_data_queue);
        s_ctx.csi_data_queue = NULL;
    }

    if (s_ctx.csi_info_queue) {
        vQueueDelete(s_ctx.csi_info_queue);
        s_ctx.csi_info_queue = NULL;
    }

