md-asaduzzaman-shahin/esp32_csi_sensing_fall_detection/transmitter/managed_components/espressif__esp-radar/src/esp_radar.c
    vEventGroupDelete(s_ctx.task_exit_group);
    s_ctx.task_exit_group = NULL;
    s_ctx.init_flag = false;
    return ESP_OK;
}

esp_err_t esp_radar_csi_init(esp_radar_csi_config_t *config)
{
    if (!config) {
        return ESP_ERR_INVALID_ARG;
    }
    wifi_csi_config_t wifi_csi_config;
    s_ctx.lltf_bit_mode = false;
#if CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C61
    wifi_csi_config = (wifi_csi_config_t) {
        .enable                   = true,
        .acquire_csi_legacy       = config->acquire_csi_lltf,
        .acquire_csi_force_lltf   = config->acquire_csi_lltf,
        .acquire_csi_ht20         = config->acquire_csi_ht20,
        .acquire_csi_ht40         = config->acquire_csi_ht40,
        .acquire_csi_vht          = config->acquire_csi_vht,
        .acquire_csi_su           = config->acquire_csi_su,
        .acquire_csi_mu           = config->acquire_csi_mu,
        .acquire_csi_dcm          = config->acquire_csi_dcm,
        .acquire_csi_beamformed   = config->acquire_csi_beamformed,
        .acquire_csi_he_stbc_mode = config->acquire_csi_he_stbc_mode,
        .val_scale_cfg            = config->val_scale_cfg,
        .dump_ack_en              = config->dump_ack_en,
        .reserved                 = 0
    };
    if (config->acquire_csi_lltf) {
        ESP_LOGW(TAG, "%s: LLTF collection is enabled, other collection settings will be ignored", CONFIG_IDF_TARGET);
    }
    s_ctx.lltf_bit_mode = config->acquire_csi_lltf;
#elif CONFIG_IDF_TARGET_ESP32C6
    wifi_csi_config = (wifi_csi_config_t) {
        .enable                 = true,
        .acquire_csi_legacy     = config->acquire_csi_lltf,
        .acquire_csi_ht20       = config->acquire_csi_ht20,
        .acquire_csi_ht40       = config->acquire_csi_ht40,
        .acquire_csi_su         = config->acquire_csi_su,
        .acquire_csi_mu         = config->acquire_csi_mu,
        .acquire_csi_dcm        = config->acquire_csi_dcm,
        .acquire_csi_beamformed = config->acquire_csi_beamformed,
        .acquire_csi_he_stbc    = config->acquire_csi_he_stbc_mode,
        .val_scale_cfg          = config->val_scale_cfg,
        .dump_ack_en            = config->dump_ack_en,
        .reserved               = 0
    };
#elif CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32
    wifi_csi_config = (wifi_csi_config_t) {
        .lltf_en                = config->lltf_en,
        .htltf_en               = config->htltf_en,
        .stbc_htltf2_en         = config->stbc_htltf2_en,
        .ltf_merge_en           = config->ltf_merge_en,
        .channel_filter_en      = config->channel_filter_en,
        .manu_scale             = config->manu_scale,
        .shift                  = config->shift,
        .dump_ack_en            = config->dump_ack_en,
    };
#else
    ESP_LOGE(TAG, "CSI functionality is not supported for %s.", CONFIG_IDF_TARGET);
    return ESP_ERR_NOT_SUPPORTED;
#endif
    ESP_ERROR_CHECK(esp_wifi_set_promiscuous(true));
    ESP_ERROR_CHECK(esp_wifi_set_csi_config(&wifi_csi_config));
    ESP_ERROR_CHECK(esp_wifi_set_csi_rx_cb(esp_radar_csi_rx_cb, config->csi_filtered_cb_ctx));
    ESP_ERROR_CHECK(esp_wifi_set_csi(true));

    memcpy(&s_ctx.csi_config, config, sizeof(esp_radar_csi_config_t));

    return ESP_OK;
}

esp_err_t esp_radar_wifi_init(esp_radar_wifi_config_t *config)
{
    static bool s_wifi_inited = false;
    if (!config) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!s_wifi_inited) {
        ESP_ERROR_CHECK(esp_event_loop_create_default());
        ESP_ERROR_CHECK(esp_netif_init());
        s_wifi_inited = true;
    }
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));
    if (!ADDR_IS_EMPTY(config->mac_address)) {
        ESP_ERROR_CHECK(esp_wifi_set_mac(WIFI_IF_STA, config->mac_address));
    }

#if !CONFIG_IDF_TARGET_ESP32C5
    if (config->band_mode == WIFI_BAND_MODE_5G_ONLY || config->band_mode == WIFI_BAND_MODE_AUTO) {
        ESP_LOGW(TAG, "%s does not support 5GHz band_mode, forcing to WIFI_BAND_MODE_2G_ONLY", CONFIG_IDF_TARGET);
        config->band_mode = WIFI_BAND_MODE_2G_ONLY;
    }
    if (config->protocols.ghz_5g != 0) {
        ESP_LOGW(TAG, "%s does not support 5GHz protocols, clearing 5GHz protocol configuration", CONFIG_IDF_TARGET);
        config->protocols.ghz_5g = 0;
    }
    if (config->bandwidths.ghz_5g != 0) {
        ESP_LOGW(TAG, "%s does not support 5GHz bandwidths, clearing 5GHz bandwidth configuration", CONFIG_IDF_TARGET);
        config->bandwidths.ghz_5g = 0;
    }
#endif
    esp_netif_create_default_wifi_sta();
#if CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C61
    ESP_ERROR_CHECK(esp_wifi_start());
    ESP_ERROR_CHECK(esp_wifi_set_band_mode(config->band_mode));
    ESP_ERROR_CHECK(esp_wifi_set_protocols(ESP_IF_WIFI_STA, &config->protocols));
    ESP_ERROR_CHECK(esp_wifi_set_bandwidths(ESP_IF_WIFI_STA, &config->bandwidths));
    bool is_20mhz = (config->channel <= 13 && config->bandwidths.ghz_2g == WIFI_BW_HT20) ||
                    (config->channel > 13 && config->bandwidths.ghz_5g == WIFI_BW_HT20);
#else
    ESP_ERROR_CHECK(esp_wifi_set_protocols(ESP_IF_WIFI_STA, &config->protocols));
    ESP_ERROR_CHECK(esp_wifi_set_bandwidth(ESP_IF_WIFI_STA, config->bandwidths.ghz_2g));
    ESP_ERROR_CHECK(esp_wifi_start());
    bool is_20mhz = (config->bandwidths.ghz_2g == WIFI_BW_HT20);
#endif

    if (is_20mhz) {
        if (config->second_chan != WIFI_SECOND_CHAN_NONE) {
            ESP_LOGW(TAG, "20MHz bandwidth configured but secondary channel is set to %d, forcing to NONE (channel: %d)",
                     config->second_chan, config->channel);
        }
        ESP_ERROR_CHECK(esp_wifi_set_channel(config->channel, WIFI_SECOND_CHAN_NONE));
    } else {
        ESP_ERROR_CHECK(esp_wifi_set_channel(config->channel, config->second_chan));
    }
    ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE));
    memcpy(&s_ctx.wifi_config, config, sizeof(esp_radar_wifi_config_t));
    return ESP_OK;
}

esp_err_t esp_radar_espnow_init(esp_radar_espnow_config_t *config)
{
    if (!config) {
        return ESP_ERR_INVALID_ARG;
    }
    if (s_ctx.wifi_config.channel == 0) {
        ESP_LOGW(TAG, "channel is not set, please first run esp_radar_wifi_init");
        return ESP_ERR_INVALID_STATE;
    }
    esp_now_peer_info_t peer = {
        .channel   = s_ctx.wifi_config.channel,
        .ifidx     = WIFI_IF_STA,
        .encrypt   = false,
    };
    memcpy(peer.peer_addr, config->peer_addr, sizeof(peer.peer_addr));

    ESP_ERROR_CHECK(esp_now_init());
    ESP_ERROR_CHECK(esp_now_set_pmk((uint8_t *)config->pmk));
    ESP_ERROR_CHECK(esp_now_add_peer(&peer));
    wifi_phy_mode_t phy_mode = 0;
    if (s_ctx.wifi_config.channel <= 13) {
        switch (s_ctx.wifi_config.protocols.ghz_2g) {
        case WIFI_PROTOCOL_11B:
            ESP_LOGW(TAG, "11b not supported csi");
            phy_mode = WIFI_PHY_MODE_11B;
            break;
        case WIFI_PROTOCOL_11G:
            phy_mode = WIFI_PHY_MODE_11G;
            break;
        case WIFI_PROTOCOL_11N:
            if (s_ctx.wifi_config.bandwidths.ghz_2g == WIFI_BW_HT20) {
                phy_mode = WIFI_PHY_MODE_HT20;
            } else {
                phy_mode = WIFI_PHY_MODE_HT40;
            }
            break;
        case WIFI_PROTOCOL_11AX:
            phy_mode = WIFI_PHY_MODE_HE20;
            break;
        }
    } else {
        switch (s_ctx.wifi_config.protocols.ghz_5g) {
        case WIFI_PROTOCOL_11A:
        case WIFI_PROTOCOL_11AC:
            if (s_ctx.wifi_config.bandwidths.ghz_5g == WIFI_BW_HT20) {
                phy_mode = WIFI_PHY_MODE_HT20;
            } else {
                phy_mode = WIFI_PHY_MODE_HT40;
            }
            break;
        case WIFI_PROTOCOL_11AX:
            phy_mode = WIFI_PHY_MODE_HE20;
            break;
        }
    }

    esp_now_rate_config_t rate_config = {
        .phymode = phy_mode,
        .rate = config->rate,
        .ersu = false,
        .dcm = false
    };
    ESP_ERROR_CHECK(esp_now_set_peer_rate_config(peer.peer_addr, &rate_config));
    memcpy(&s_ctx.espnow_config, config, sizeof(esp_radar_espnow_config_t));
    return ESP_OK;
}

