md-asaduzzaman-shahin/esp32_csi_sensing_fall_detection/transmitter/managed_components/espressif__esp-radar/src/esp_radar.c
esp_err_t esp_radar_get_config(esp_radar_config_t *config)
{
    if (!config) {
        return ESP_ERR_INVALID_ARG;
    }

    memcpy(&config->wifi_config, &s_ctx.wifi_config, sizeof(esp_radar_wifi_config_t));
    memcpy(&config->csi_config, &s_ctx.csi_config, sizeof(esp_radar_csi_config_t));
    memcpy(&config->espnow_config, &s_ctx.espnow_config, sizeof(esp_radar_espnow_config_t));
    memcpy(&config->dec_config, &s_ctx.dec_config, sizeof(esp_radar_dec_config_t));
    return ESP_OK;
}
esp_err_t esp_radar_wifi_reinit(esp_radar_wifi_config_t *config)
{
    if (!config) {
        return ESP_ERR_INVALID_ARG;
    }
    esp_wifi_stop();
    esp_wifi_deinit();
    esp_err_t ret = esp_radar_wifi_init(config);
    if (ret != ESP_OK) {
        return ret;
    }
    return ESP_OK;
}
esp_err_t esp_radar_change_config(esp_radar_config_t *config)
{
    if (!config) {
        return ESP_ERR_INVALID_ARG;
    }
    esp_radar_wifi_config_t *wifi_config = &config->wifi_config;
    esp_radar_csi_config_t *csi_config = &config->csi_config;
    esp_radar_espnow_config_t *espnow_config = &config->espnow_config;
    esp_radar_dec_config_t *dec_config = &config->dec_config;
    bool need_start = false;
    if (s_ctx.run_flag) {
        esp_radar_stop();
        need_start = true;
    }
    if (wifi_config && memcmp(wifi_config, &s_ctx.wifi_config, sizeof(esp_radar_wifi_config_t)) != 0) {
        esp_radar_wifi_reinit(wifi_config);
    }
    if (espnow_config && memcmp(espnow_config, &s_ctx.espnow_config, sizeof(esp_radar_espnow_config_t)) != 0) {
        esp_radar_espnow_init(espnow_config);
    }
    if (csi_config && memcmp(csi_config, &s_ctx.csi_config, sizeof(esp_radar_csi_config_t)) != 0) {
        esp_radar_csi_init(csi_config);
    }
    if (dec_config && memcmp(dec_config, &s_ctx.dec_config, sizeof(esp_radar_dec_config_t)) != 0) {
        esp_radar_dec_init(dec_config);
    }
    if (need_start) {
        esp_radar_start();
    }
    return ESP_OK;
}
esp_err_t esp_radar_dec_init(esp_radar_dec_config_t *config)
{
    if (!config) {
        return ESP_ERR_INVALID_ARG;
    }
    if (s_ctx.init_flag) {
        ESP_LOGW(TAG, "esp_radar already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    s_ctx.init_flag = true;
    memcpy(&s_ctx.dec_config, config, sizeof(esp_radar_dec_config_t));
    if (s_ctx.dec_config.pca_window_size < RADAR_PCA_WINDOW_DEFAULT) {
        ESP_LOGW(TAG, "pca_window_size < 2, fallback to default: %d", RADAR_PCA_WINDOW_DEFAULT);
        s_ctx.dec_config.pca_window_size = RADAR_PCA_WINDOW_DEFAULT;
    }

#if WIFI_CSI_PHY_GAIN_ENABLE
    esp_csi_gain_ctrl_reset_rx_gain_baseline();
#endif
    return ESP_OK;
}

esp_err_t esp_radar_init(esp_radar_config_t *config)
{
    if (!config) {
        return ESP_ERR_INVALID_ARG;
    }
    esp_radar_wifi_init(&config->wifi_config);
    esp_radar_espnow_init(&config->espnow_config);
    esp_radar_csi_init(&config->csi_config);
    esp_radar_dec_init(&config->dec_config);
    return ESP_OK;
}
esp_err_t esp_radar_deinit()
{
    ESP_ERROR_CHECK(esp_wifi_set_csi(false));
    if (s_radar_calibrate) {
        radar_calibrate_free_entries(s_radar_calibrate);
        RADAR_FREE(s_radar_calibrate);
    }
    s_waveform_wander_last = 0.0f;
    memset(&s_ctx, 0, sizeof(s_ctx));

    return ESP_OK;
}
